benchmarks/logs/2026-04-29_10-47-29/burst_get_bookmarks.txt
Running 30s test @ http://localhost:8080/bookmarks
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.35ms    4.21ms  41.29ms   96.36%
    Req/Sec     3.02k   350.94     3.28k    86.00%
  Latency Distribution
     50%    1.42ms
     75%    1.50ms
     90%    2.81ms
     99%   28.80ms
  180494 requests in 30.01s, 1.90GB read
Requests/sec:   6014.44
Transfer/sec:     64.99MB